In [4]:
import pandas as pd

data = pd.read_csv('C:/Users/RAJ/Desktop/PY/real-estate-predictor/data/bengaluru_house_prices.csv')
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [6]:
data = data.drop(['area_type', 'availability','society'], axis=1)

In [8]:
data.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [10]:
data = data.dropna(subset=['location','size'])

In [12]:
data = data.reset_index(drop=True)

In [14]:
data =data.rename(columns={'size' : 'bhk'})

In [16]:
data.head()

                   location        bhk total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [18]:
data['bhk'] = data['bhk'].str.split()

In [20]:
data.head()

                   location           bhk total_sqft  bath  balcony   price
0  Electronic City Phase II      [2, BHK]       1056   2.0      1.0   39.07
1          Chikka Tirupathi  [4, Bedroom]       2600   5.0      3.0  120.00
2               Uttarahalli      [3, BHK]       1440   2.0      3.0   62.00
3        Lingadheeranahalli      [3, BHK]       1521   3.0      1.0   95.00
4                  Kothanur      [2, BHK]       1200   2.0      1.0   51.00

In [22]:
for i in range(len(data['bhk'])):
    data['bhk'] = data['bhk'][i][0]

In [23]:
data.head()

                   location bhk total_sqft  bath  balcony   price
0  Electronic City Phase II   2       1056   2.0      1.0   39.07
1          Chikka Tirupathi   2       2600   5.0      3.0  120.00
2               Uttarahalli   2       1440   2.0      3.0   62.00
3        Lingadheeranahalli   2       1521   3.0      1.0   95.00
4                  Kothanur   2       1200   2.0      1.0   51.00

In [26]:
data['bhk'] = data['bhk'].astype(int)

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13303 entries, 0 to 13302
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13303 non-null  object
 1   bhk         13303 non-null  int32
 2   total_sqft  13303 non-null  object
 3   bath        13246 non-null  float64
 4   balcony     12710 non-null  float64
 5   price       13303 non-null  float64
dtypes: float64(3), int32(1), object(2)
memory usage: 571.7+ KB

In [30]:
data.head()

                   location  bhk total_sqft  bath  balcony   price
0  Electronic City Phase II    2       1056   2.0      1.0   39.07
1          Chikka Tirupathi    2       2600   5.0      3.0  120.00
2               Uttarahalli    2       1440   2.0      3.0   62.00
3        Lingadheeranahalli    2       1521   3.0      1.0   95.00
4                  Kothanur    2       1200   2.0      1.0   51.00

In [34]:
data['location'] = data['location'].str.strip()

In [80]:
loc_group = data.groupby('location')['location'].agg('count').sort_values(ascending=False)

In [86]:
len(loc_group[loc_group <= 10])

1052